# SpatialElementGeometryResults Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementGeometryResults Class
Members See Also
---
The results of spatial element geometry calculation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class SpatialElementGeometryResults : IDisposable
```

Visual Basic
---
```text
Public Class SpatialElementGeometryResults _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SpatialElementGeometryResults : IDisposable
```

# Remarks
The subfaces of a SpatialElement at the base height and top height are not associated with floors, roofs, and ceilings at the same height.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpatialElementGeometryResults
# See Also
SpatialElementGeometryResults Members
Autodesk.Revit.DB Namespace